'143'
,'اسامة سمير يعقوب عبده'
,NULL
,'000143'
,TO_DATE('2011-05-02 00:00:00', 'YYYY-MM-DD HH24:MI:SS')
,NULL
,NULL
,1
,'850461286'
,'1'
,'102'
,'نابلس'
,'1102'
,TO_DATE('1981-05-04 00:00:00', 'YYYY-MM-DD HH24:MI:SS')
,NULL
,'0599034962'
,NULL
,'Osama_abdh_1988@hotmail'
,1
,'2'
,'13'
,'1177459'
,'1008'
,NULL
,'1'
,NULL
,NULL
,NULL
,'1'
,TO_DATE('2016-04-13 13:32:21', 'YYYY-MM-DD HH24:MI:SS')
,NULL
,'1'
,0
,0
,0
,0
,NULL
,NULL
,NULL
,NULL
,1
,1
,1
,1
,1
,NULL
,0
,0
,NULL
,'Y'
,'N'
,NULL
,'0'
,NULL
,NULL
,NULL
,'6'
,'N'
,'N'
,NULL
,NULL
,0
,NULL
,NULL
,NULL
,'Y'
,NULL
,12
,NULL
,'092531962'
,NULL
,NULL
,'LS045711774590993000000'


////////////////////////// names with compound inner name ///////////////////////
'احمد محمود أحمد جبري صباح'


'عنان محمد سمير عامر عرقان'

'أسامه كمال أحمد ياسين غنام'

'عبد الفتاح محمد سعيد عبد الفتاح العبد'

'رامي محمد ماهر حسن عبيد'

'ميساء محمد أمين يوسف منير'

'محمد ربيع كمال موسى شلالدة'

'رأفت محمد فواز فايز ابو شخيدم'

'حلا ماهر محمد رمزي شقو'

'عبد الرحمن كمال محمد علي احمد'

'شذى عبد الرؤوف أحمد محمود حسين'

'عبير  محمد راضي عبد الجليل صالح'

'همام فواز فارس أبو رميلة تميمي'


///////////// manipulate emp_file to delete spaces in names like (عبد/ عبيد/ أبو/ ابو) ////////////////////////////////////