<?php

declare(strict_types=1);

return [

    'var' => [
        1 =>        '',
        2 =>        '',
        3 =>        '',
        4 =>        '',
        5 =>        '',
        6 =>        '',

    ],

    'days' => [
        'Sun' =>        'الأحد',
        'Mon' =>        'الاثنين',
        'Tue' =>        'الثلاثاء',
        'Wed' =>        'الأربعاء',
        'Thu' =>        'الخميس',
        'Fri' =>        'الجمعة',
        'Sat' =>        'السبت',

    ],

    'arabic_months' => [
        '01' => 'كانون الثاني', 
        '02' => 'شباط', 
        '03' => 'آذار', 
        '04' => 'نيسان', 
        '05' => 'أيار', 
        '06' => 'حزيران',
        '07' => 'تموز', 
        '08' => 'آب', 
        '09' => 'أيلول', 
        '10' => 'تشرين الأول', 
        '11' => 'تشرين الثاني', 
        '12' => 'كانون الأول'
    ],
    'invoice_type' => [
        1 => 'محروقات', 
        2 => 'صيانة', 
        3 => 'تأمين', 
        4 => 'ترخيص', 
        5 => 'فاتورة استااجار مركبة', 
        6 => 'غسيل', 
    ],
    'invoice_status' => [
        1 => 'قيد المراجعة',
        2 => 'تم صرف الفاتورة',
        3 => 'مرفوضة',

    ],
    'fuels' => [
        1 => 'بينزين',
        2 => 'سولار',
        3 => 'كهرباء',

    ],

    // -----------------   حالة اليوم عطلة / دوام   
    'att_status' => [
        3 =>        'دوام',
        5  =>        'عطلة رسمية ',

    ],

    // ----------------- صلاحية الموظفين على الساعة 
    'ac_role' => [
        14 =>        'آدمن',
        0  =>        'موظف عادي',

    ],

    'boolean' => [
        0 =>        'لا',
        1 =>        'نعم',

    ],

    // ----------------- الديانة
    'religion' => [
        1 =>        'مسلم',
        2 =>        'مسيحي',
        3 =>        'يهودي',
    ],

    // ----------------- الجنس 
    'gender' => [
        1 =>        'ذكر',
        2 =>        'أنثى',
    ],
    // ----------------- اذن المغادره 
    'leave' => [
        1 =>        'مغادرة خاصة',
        2 =>        'مغادرة رسمية',

    ],

    // ----------------- حالة الموظف 
    'employee_status' => [

        1 => '	على رأس عمله ',
        2 => '	اجازة بدون راتب ',
        3 => '	انهاء خدمات (فصل)  ',
        4 => '	انهاء خدمات (تقاعد)',
        5 => '	انتداب ',
        6 => '	اعارة ',
        7 => '	وقف راتب ',
        8 => '	استقالة ',
        9 => '	نقل ',
        10    => '  احالة على المعاش ',
        11    => '  معتقل  ',
        12    => '  استنكاف ',
        13    => '  وفاة ',

    ],

    // ----------------- الحالة الاجتماعية  
    'marital_status' => [
        1 =>        'أعزب',
        2 =>        'متزوج',
        3 =>        'عقد قران',
        4 =>        'مطلق',
        5 =>        'أرمل',
    ],


    // ----------------- أنواع العقود RT INTO 
    'contract_type' => [

        1 =>    'مصنف مثبت',   
        2 =>    'مصنف غير مثبت',    
        3 =>    'عقود ديوان الموظفين العام',    
        4 =>    'المياومة - عقود وزارة المالية',   
        5 =>    'المياومة - البطالة الموازية',    
        6 =>    'المياومة',
        7 =>    'شركة نظافة',    
        8 =>    'شركة أمن',

    ],
    
    // ----------------- أنواع الاجازات 
    'vacation_type' => [
        1 =>        'سنوية',
        2 =>        'مرضية',
        3 =>        'حج',
        4 =>        'أمومة',
        5 =>        'أبوة',
        6 =>        'عارضة',
        7 =>        'بدون راتب',
        8 =>        'حسم من الراتب',
        9 =>        'وفاة',
        10 =>       'مهمة عمل',
    ],

    // ----------------- أنواع الاجازة السنوية 
    'annual_vacation_type' => [
       // 0 =>        '',
        1 =>        'سنوية عادية',
        2 =>        'خارجية',
    ],

    //-------------------------------------------انواع مهمات العمل 
    'job_assignment_type' => [
        1 =>        'مهمه داخليه ',
        2 =>        'مهمه خارجيه',
    ],
     //-------------------------------------------موضوعات مهمات العمل 
     'job_assignment_supject' => [
        1 =>        ' دراسة ',
        2 =>        'تدريب ',
        3 =>        'مؤتمر ',
        4 =>        'ورشة عمل ',
        5 =>        'اجتماع ',
        6 =>        'اخرى ',
    ],
     //-------------------------------------------موضوعات مهمات العمل 
     'hosting_type' => [
        1 =>        ' كامل ',
        2 =>        'جزئي ',
        3 =>        'مبيت فقط ',
        4 =>        ' تذاكر طيران فقط  ',
        5 =>        'غير مستضافه ',
       
    ],
    // ----------------- أنواع الحركات 
    'vacation_status' => [
        1 =>        'بانتظار الموافقة',
        2 =>        'معتمدة',
        3 =>        'مرفوضة',
        4 =>        'ملغية',
    ],

    // -----------------  Status Class 
    'status_class' => [
        1 =>        'bi bi-exclamation-triangle-fill text-warning  fs-5',
        2 =>        'bi bi-check-circle-fill text-success fs-5',
        3 =>        'bi bi-x-circle-fill text-danger  fs-5',
        4 =>        'bi bi-trash3-fill text-secondary  fs-5',
    ],

    // ----------------- الدرجة العلمية
    'academic_degree' => [
        1 =>        'ثانوية عامة',
        2 =>        'دبلوم ',
        3 =>        'دبلوم عالي ',
        4 =>        'بكالوريس ',
        5 =>        'ماجستير',
        6 =>        'دكتوراة',

    ],

    // ----------------- التقدير الجامعي
    'degree' => [
        1 =>        'ممتاز',
        2 =>        'جيدجدًا',
        3 =>        'جيد',
        4 =>        'مقبول',
    ],

    // ----------------- الفئات 
    'class' => [
        1 =>        'الفئة الخاصة',
        2 =>        'الفئة العليا',
        3 =>        'الفئة الأولى',
        4 =>        'الفئة الثانية',
        5 =>        'الفئة الثالثة',
        6 =>        'الفئة الرابعة',
        7 =>        'الفئة الخامسة',
    ],

    //اختصارات الكشف السنوي 

    'gpc_att_codes'=> [
        	'	N	'	=>	'	نقل من وزارة إلى أخرى	',
        	'	L	'	=>	'	إجازة سنوية	',
        	'	W	'	=>	'	إجازة بدون راتب	',
        	'	M	'	=>	'	إجازة أمومة	',
        	'	A	'	=>	'	حادث عمل	',
        	'	-	'	=>	'	غياب بدون إذن	',
        	'	T	'	=>	'	إجازة طارئة	',
        	'	R	'	=>	'	مهمة عمل	',
        	'	P	'	=>	'	ايقاف عن العمل	',
        	'	H	'	=>	'	حج	',
        	'	F	'	=>	'	عطل أسبوعية	',
        	'	V	'	=>	'	أعياد ومناسبات رسمية	',
        	'	*	'	=>	'	فارغ	',
        	'	X	'	=>	'	أيام تأخير	',
        	'	+	'	=>	'	أيام العمل	',
        	'	J	'	=>	'	رمز j	',
        	'	S	'	=>	'	إجازة مرضية	',
        	'	E	'	=>	'	لا يوجد نوقيع على ملف الدوام	',
        	'	U	'	=>	'	إجازة دراسية	',
        	'	SH	'	=>	'	مناوبة	',
        	'	B	'	=>	'	مرافقة زوجها السفير	',
        	'	K	'	=>	'	غياب بسبب الكورونا	',
        	'	Z	'	=>	'	لحسم من الراتب	',
        	'	Y   '	=>	'	إجازة ابوة		'
        
        
     ],

    // ----------------- الفئة العليا 
    'd' => [
        '2' => [
            1 =>        'A',
            2 =>        'A1',
            3 =>        'A2',
            4 =>        'A3',
            5 =>        'A4',
        ],
        // ----------------- الفئة الأولى 
        '3' => [
            1 =>        'B',
            2 =>        'C',
        ],


        // ----------------- الفئة الثانية 

        '4' => [
            1 =>        '1',
            2 =>        '2',
            3 =>        '3',
            4 =>        '4',
            5 =>        '5',
            6 =>        '6',
            7 =>        '7',
            8 =>        '8',
            9 =>        '9',
        ],

        // ----------------- الفئة الثالثة 

        '5' => [
            1 =>        '2',
            2 =>        '3',
            3 =>        '4',
            4 =>        '5',
            5 =>        '6',
            6 =>        '7',
            7 =>        '8',
            8 =>        '9',
        ],


        // ----------------- الفئة الرابعة 
        '6' => [
            1 =>        '5',
            2 =>        '6',
            3 =>        '7',
            4 =>        '8',
            5 =>        '9',
        ],


        // ----------------- الفئة الخامسة 
        '7' => [
            1 =>        '6',
            2 =>        '7',
            3 =>        '8',
            4 =>        '9',
            5 =>        '10',
        ],
    ],


    
    'country' => [     
        1   =>  'فلسطين'    ,     
        2   =>  'الاردن'     ,
        3   =>  'مصر'       ,
        4   =>  'الكويت'    ,
        5   =>  'ليبيا'     ,
        6   =>  'الامارات'    ,     
        7   =>  'السعودية'     ,
        8   =>  'اليمن'     ,
        9   =>  'العراق'    ,
        10   =>  'لبنان'    , 
        11   =>  'سوريا'    ,
        12   =>  'الجزائر'    ,
        13   =>  'فنزويلا'    ,
        14   =>  'الولايات المتحدة الامريكية'       ,
        15   =>  'الهند'    ,
        16   =>  'روسيا'     ,
        17   =>  'باكستان'       ,
        18   =>  'بلغاريا'     ,
    ],


    'city' => [
        1 =>        'القدس',
        2 =>        'رام الله',
        3 =>        'نابلس',
        4 =>        'طولكرم',
        5 =>        'جنين',
        6 =>        'قلقلية',
        7 =>        'سلفيت  ',
        8 =>        'بيت لحم',
        9 =>        'طوباس',
        10 =>        'أريحا',
        11 =>        'روابي',
        12 =>        'الخليل',
        13 =>       'البيرة',
        14 =>       'بيرزيت' ,
        15 =>        'غزة',
        16 =>        'الناصرة' ,

    ],


    // ----------------- المسمى الوظيفي
    'job_title' => [
        1 =>        '	مساعد رئيس شعبة 	',
        2 =>        '	مبرمج	',
        3 =>        '	مدير بريد فئة ب	',
        4 =>        '	مدير بريد فئة ج	',
        5 =>        '	موزع بريد 	',
        6 =>        '	مسؤول شباك بريد	',
        7 =>        '	مساعد اداري 	',
        8 =>        '	موظف اداري 	',
        9 =>        '	محاسب	',
        10 =>        '	موظف حاسوب	',
        11 =>        '	موظف فرز	',
        12 =>        '	موظف صيانة	',
        13 =>        '	مأمور تسهيلات	',
        14 =>        '	اداري 	',
        15 =>        '	سائق	',
        16 =>        '	سائق ومرافق	',
        17 =>        '	مساعد قانوني 	',
        18 =>        '	مستشار قانوني مساعد	',
        19 =>        '	مراسل	',
        20 =>        '	سكرتاريا	',
        21 =>        '	كاتب	',
        22 =>        '	مدخل بيانات	',
        23 =>        '	أمين مستودع 	',
        24 =>        '	باحث ميداني	',
        25 =>        '	موظف اعلام 	',
        26 =>        '	موظف استعلامات	',
        27 =>        '	موظف مواصفات 	',
        28 =>        '	موظف مالي 	',
        29 =>        '	موظف تسويق	',
        30 =>        '	مهندس الكتروني واتصالات	',
        31 =>        '	مراقب 	',
        32 =>        '	مهني أ	',
        33 =>        '	بدون	',
        34 =>        '	ق.أ مدير عام	',
        35 =>        '	مدير	',
        36 =>        '	رئيس قسم	',
        37 =>        '	رئيس شعبة	',
        38 =>        '	مبرمج	',
        39 =>        '	مدير	',
        40 =>        '	عامل تنظيفات	',
        41 =>        '	موظف خدمات إدارية	',
        42 =>        '	ق.أ نائب	',
        43 =>        '	رئيس وحدة البنك الدولي	',
        44 =>        '	باحث اقتصادي	',
        45 =>        '	مدير عام	',
        46 =>        '	رئيس	',
        47 =>        '	مستشار الوزير	',
        48 =>        '	مدير مكتب	',
        49 =>        '	مهندس	',
        50 =>        '	مهندس اتصالات	',
        51 =>        '	مهندس حاسوب	',
        52 =>        '	مهندس كهرباء	',
        53 =>        '	مدير بريد فئة أ	',
        54 =>        '	مأمور فرز	',
        55 =>        '	خبير بريدي	',
        56 =>        '	خبير اتصالات	',
        57 =>        '	خبير  IT	',
        58 =>        '	فني تكييف وتبريد	',
        59 =>        '	فني صيانة	',
        60 =>        '	موظف استقبال	',
        61 =>        '	موظف أرشيف 	',
        62 =>        '	عامل	',
        63 =>        '	ق.أ مدير	',
        64 =>        '	مستشار الوزير لشؤون الاتصالات	',
        65 =>        '	مشرف	',
        66 =>        '	ق.أ وحدة النوع الاجتماعي	',
        67 =>        '	مترجم	',
        68 =>        '	وزير	',
        69 =>        '	مستشار قانوني	',
        70 =>        '	ق.أ الوكيل	',
        71 =>        '	نائب رئيس	',
        72 =>        '	باحث قانوني	',
        73 =>        '	مهندس ميكاترونكس	',
        74 =>        '	موظف علاقات عامة	',
        75 =>        '	نائب مدير	',
        76 =>        '	ق.أ رئيس	',
        77 =>        '	ق.أ وكيل الوزارة 	',


    ],


    'nationality' => [
        1 =>        '	 أفغاني	',
        2 =>        '	 ألباني	',
        3 =>        '	 جزائري	',
        4 =>        '	 أندورا	',
        5 =>        '	 أنغولي	',
        6 =>        '	 أرجنتيني	',
        7 =>        '	 أرماني	',
        8 =>        '	 أسترالي	',
        9 =>        '	 نمساوي	',
        10 =>        '	 أذربيجاني	',
        11 =>        '	 بهامي	',
        12 =>        '	 بحريني	',
        13 =>        '	 بنجلاديشي	',
        14 =>        '	 بربادوسي	',
        15 =>        '	 بيلاروسي	',
        16 =>        '	 بلجيكي	',
        17 =>        '	 بليزي	',
        18 =>        '	 بنيني	',
        19 =>        '	 بوتاني	',
        20 =>        '	 بوليفي	',
        21 =>        '	 بوسني	',
        22 =>        '	 بوتسواني	',
        23 =>        '	 برازيلي	',
        24 =>        '	 بروناي	',
        25 =>        '	 بلغاري	',
        26 =>        '	 بوركيني	',
        27 =>        '	 بوروندي	',
        28 =>        '	 كمبودي	',
        29 =>        '	 كاميروني	',
        30 =>        '	 كندي	',
        31 =>        '	 تشادي	',
        32 =>        '	 شيلي	',
        33 =>        '	 صيني	',
        34 =>        '	 كولومبي	',
        35 =>        '	 كونغولي	',
        36 =>        '	 كوستاريكي	',
        37 =>        '	 كرواتي	',
        38 =>        '	 كوبي	',
        39 =>        '	 قبرصي	',
        40 =>        '	 تشيكي	',
        41 =>        '	 دنماركي	',
        42 =>        '	 جيبوتي	',
        43 =>        '	 دومينيكاني	',
        44 =>        '	 دومينيكاني	',
        45 =>        '	 إكوادوري	',
        46 =>        '	 مصري	',
        47 =>        '	 سلفادوري	',
        48 =>        '	 إريتري	',
        49 =>        '	 إستوني	',
        50 =>        '	 إثيوبي	',
        51 =>        '	 فيجي	',
        52 =>        '	 فنلندي	',
        53 =>        '	 فرنسي	',
        54 =>        '	 غابوني	',
        55 =>        '	 غامبي	',
        56 =>        '	 جورجي	',
        57 =>        '	 ألماني	',
        58 =>        '	 غاني	',
        59 =>        '	 يوناني	',
        60 =>        '	 غرينادي	',
        61 =>        '	 غواتيمالي	',
        62 =>        '	 غيني	',
        63 =>        '	 هايتي	',
        64 =>        '	 هندوراسي	',
        65 =>        '	 هنغاري	',
        66 =>        '	 أيسلندي	',
        67 =>        '	 هندي	',
        68 =>        '	 أندونيسي	',
        69 =>        '	 إيراني	',
        70 =>        '	 عراقي	',
        71 =>        '	 أيرلندي	',
        72 =>        '	 إسرائيلي	',
        73 =>        '	 إيطالي	',
        74 =>        '	 جامايكي	',
        75 =>        '	 ياباني	',
        76 =>        '	 أردني	',
        77 =>        '	 كازاخستاني	',
        78 =>        '	 كيني	',
        79 =>        '	 كوري	',
        80 =>        '	 كويتي	',
        81 =>        '	 لاوسي	',
        82 =>        '	 لاتفي	',
        83 =>        '	 لبناني	',
        84 =>        '	 ليبيري	',
        85 =>        '	 ليبي	',
        86 =>        '	 ليتواني	',
        87 =>        '	 مقدوني	',
        88 =>        '	 مدغشقري	',
        89 =>        '	 مالاوي	',
        90 =>        '	 ماليزي	',
        91 =>        '	 مالديفي	',
        92 =>        '	 مالي	',
        93 =>        '	 مالطي	',
        94 =>        '	 موريتاني	',
        95 =>        '	 موريشيوسي	',
        96 =>        '	 مكسيكي	',
        97 =>        '	 مولدوفي	',
        98 =>        '	 منغولي	',
        99 =>        '	 مونتينيغري	',
        100 =>        '	 مغربي	',
        101 =>        '	 موزمبيقي	',
        102 =>        '	 ناميبي	',
        103 =>        '	 نيبالي	',
        104 =>        '	 هولندي	',
        105 =>        '	 نيوزيلندي	',
        106 =>        '	 نيكاراغوي	',
        107 =>        '	 نيجيري	',
        108 =>        '	 نيجيري	',
        109 =>        '	 نرويجي	',
        110 =>        '	 عماني	',
        111 =>        '	 باكستاني	',
        112 =>        '	 بنمي	',
        113 =>        '	 باراغواي	',
        114 =>        '	 بيروي	',
        115 =>        '	 فلبيني	',
        116 =>        '	 بولندي	',
        117 =>        '	 برتغالي	',
        118 =>        '	 قطري	',
        119 =>        '	 روماني	',
        120 =>        '	 روسي	',
        121 =>        '	 رواندي	',
        122 =>        '	 سعودي	',
        123 =>        '	 سنغالي	',
        124 =>        '	 صربي	',
        125 =>        '	 سيراليوني	',
        126 =>        '	 سنغافوري	',
        127 =>        '	 سلوفاكيا	',
        128 =>        '	 سلوفيني	',
        129 =>        '	 صومالي	',
        130 =>        '	 جنوب افريقي 	',
        131 =>        '	 إسباني	',
        132 =>        '	 سريلانكي	',
        133 =>        '	 سوداني	',
        134 =>        '	 سوازيلاندي	',
        135 =>        '	 سويدي	',
        136 =>        '	 سويسري	',
        137 =>        '	 سوري	',
        138 =>        '	 طاجيكي	',
        139 =>        '	 تنزاني	',
        140 =>        '	 تايلاندي	',
        141 =>        '	 توغو	',
        142 =>        '	 تونسي	',
        143 =>        '	 تركي	',
        144 =>        '	 تركمان	',
        145 =>        '	 أوغندي	',
        146 =>        '	 أوكراني	',
        147 =>        '	 إماراتي	',
        148 =>        '	 إنجليزي	',
        149 =>        '	 أمريكي	',
        150 =>        '	 أوروغواي	',
        151 =>        '	 أوزبكي	',
        152 =>        '	 فنزويلي	',
        153 =>        '	 فيتنامي	',
        154 =>        '	 يمن	',
        155 =>        '	 زامبي	',
        156 =>        '	 زيمبابوي	',




    ],



     // ----------------- تقسيم الهيكلية
     'Box' => [
        '1' => [
            'name'      =>        'الوزير'  ,
            'level'     =>        '1'       ,
        ],
        
        '2' => [
            'name'      =>        'مستشار'  ,
            'level'     =>        '2'       ,
        ],

        '3' => [
            'name'      =>        'وكيل'  ,
            'level'     =>        '2'       ,
        ],

        '4' => [
            'name'      =>        'وحدة'  ,
            'level'     =>        '2'       ,
        ],

        '5' => [
            'name'      =>        'إدارة عامة'  ,
            'level'     =>        '3'       ,
        ],

        '6' => [
            'name'      =>        'دائرة'  ,
            'level'     =>        '4'       ,
        ],

        '7' => [
            'name'      =>        'مدير مكتب بريد أ',
            'level'     =>        '4'       ,
        ],       

        '8' => [
            'name'      =>        'قسم'  ,
            'level'     =>        '5'       ,
        ],

        '9' => [
            'name'      =>        'مدير مكتب بريد ب'  ,
            'level'     =>        '5'       ,
        ],         
        
        '10' => [
            'name'      =>        'شعبة'  ,
            'level'     =>        '6'       ,
        ],        
        
        '11' => [
            'name'      =>        'مدير مكتب بريد ج'  ,
            'level'     =>        '6'       ,
        ],  

        
        '12' => [
            'name'      =>        'ديوان الوزير'  ,
            'level'     =>        '2'       ,
        ],          
    ],


];
